docs: add excalidraw diagram
